strings = {
    "ask_replay": {
        "en": "✍️ قم بالرد على رسالة رقم الهاتف بالنص الذي تود إرساله",
        "ar": "✍️ قم بالرد على رسالة رقم الهاتف بالنص الذي تود إرساله",
    },
    "number_invalid": {
        "en": "☎️ يمكنك الرد فقط على الرسائل التي تحتوي على رقم هاتف",
        "ar": "☎️ يمكنك الرد فقط على الرسائل التي تحتوي على رقم هاتف",
    },
    "invalid_length": {
        "en": "❌ الرجاء إدخال رقم صحيح بصيغة دولية (مثال: +966501234567)",
        "ar": "❌ الرجاء إدخال رقم صحيح بصيغة دولية (مثال: +966501234567)",
    },
    "replay_url": {
        "en": "اضغط هنا للحصول على الرابط / نسخه: {}",
        "ar": "اضغط هنا للحصول على الرابط / نسخه: {}",
    },
    "url_btn": {
        "en": "🔗 رابط",
        "ar": "🔗 رابط",
    },
    "share_btn": {
        "en": "♻️ مشاركة",
        "ar": "♻️ مشاركة",
    },
    "do_not_replay_to_ask": {
        "en": "💬 الرجاء الرد على رسالة تحتوي على رقم هاتف",
        "ar": "💬 الرجاء الرد على رسالة تحتوي على رقم هاتف",
    },
    "inline_btn": {
        "en": "🔁 جرّب الوضع المضمن!",
        "ar": "🔁 جرّب الوضع المضمن!",
    },
    "start_msg": {
        "en": "مرحبًا {} 👋\n\nيمكنك إرسال رقم هاتف ونص، وسأقوم بإعطائك رابطًا يمكنك الضغط عليه ليأخذك مباشرة إلى دردشة WhatsApp مع نفس الرقم، ومع وجود النص جاهز للإرسال!\n\nيمكنك أيضًا استخدامي بطريقة مضمّنة (Inline): فقط اكتب اسم البوت متبوعًا برقم الهاتف والنص.\n\n- للمساعدة أرسل /help\n- للمساهمة في ترجمة البوت أرسل /translate\n\n- تم تطوير هذا البوت بمحبة بواسطة [David Lev]({}) و [Yehuda By]({}) من فريق [RobotTrick]({})",
        "ar": "مرحبًا {} 👋\n\nيمكنك إرسال رقم هاتف ونص، وسأقوم بإعطائك رابطًا يمكنك الضغط عليه ليأخذك مباشرة إلى دردشة WhatsApp مع نفس الرقم، ومع وجود النص جاهز للإرسال!\n\nيمكنك أيضًا استخدامي بطريقة مضمّنة (Inline): فقط اكتب اسم البوت متبوعًا برقم الهاتف والنص.\n\n- للمساعدة أرسل /help\n- للمساهمة في ترجمة البوت أرسل /translate\n\n- تم تطوير هذا البوت بمحبة بواسطة [David Lev]({}) و [Yehuda By]({}) من فريق [RobotTrick]({})",
    },
    "repo": {
        "en": "🛠 جيت هب",
        "ar": "🛠 جيت هب",
    },
    "url_repo": {
        "en": "https://github.com/RobotTrick/WhatsApp-API-Bot",
    },
    "support": {
        "en": "👤 الدعم",
        "ar": "👤 الدعم",
    },
    "input_sug": {
        "en": "أدخل مثل: +966501234567 مرحبًا من تيليجرام",
        "ar": "أدخل مثل: +966501234567 مرحبًا من تيليجرام",
    },
    "help_msg": {
        "en": "يتيح لك هذا البوت إنشاء روابط مباشرة إلى دردشات WhatsApp مع نص جاهز للإرسال.\n\nهناك طريقتان لاستخدام البوت:\n\n1. **الرسائل والردود:**\n- أرسل رقم الهاتف.\n- قم بالرد على **رسالة الرقم** بالنص المطلوب إرساله.\n- ستحصل على رابط جاهز للضغط والنسخ.\n\n2. **الوضع المضمّن (Inline):**\n- اكتب اسم المستخدم الخاص بالبوت في أي محادثة.\n- بعده مباشرة اكتب رقم الهاتف ثم النص.\n- اضغط على النتيجة التي تظهر للحصول على الرابط.",
        "ar": "يتيح لك هذا البوت إنشاء روابط مباشرة إلى دردشات WhatsApp مع نص جاهز للإرسال.\n\nهناك طريقتان لاستخدام البوت:\n\n1. **الرسائل والردود:**\n- أرسل رقم الهاتف.\n- قم بالرد على **رسالة الرقم** بالنص المطلوب إرساله.\n- ستحصل على رابط جاهز للضغط والنسخ.\n\n2. **الوضع المضمّن (Inline):**\n- اكتب اسم المستخدم الخاص بالبوت في أي محادثة.\n- بعده مباشرة اكتب رقم الهاتف ثم النص.\n- اضغط على النتيجة التي تظهر للحصول على الرابط.",
    },
    "translate": {
        "en": "**🔡 نحتاج مساعدتك في ترجمة البوت!**\n\nإذا كنت مهتمًا بترجمة البوت إلى لغتك أو إلى لغة أخرى، انتقل إلى ملف النصوص على GitHub، قم بتحميله أو تعديله مباشرة وأضف الترجمات حسب التنسيق الموجود.\n\n- هل واجهت صعوبة؟ تواصل مع دعم المستخدم الخاص بنا.",
        "ar": "**🔡 نحتاج مساعدتك في ترجمة البوت!**\n\nإذا كنت مهتمًا بترجمة البوت إلى لغتك أو إلى لغة أخرى، انتقل إلى ملف النصوص على GitHub، قم بتحميله أو تعديله مباشرة وأضف الترجمات حسب التنسيق الموجود.\n\n- هل واجهت صعوبة؟ تواصل مع دعم المستخدم الخاص بنا.",
    },
}
